[
	{
		"quote": "Walking on water and developing software from a specification are easy if both are frozen.",
		"source": "Edward V Berard"
	},
	{
		"quote": "Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter.",
		"source": "Eric S. Raymond"
	},
	{
		"quote": "Talk is cheap. Show me the code.",
		"source": "Linus Torvalds"
	},
	{
		"quote": "In God we trust. All others must bring data.",
		"source": "W. Edwards Demming"
	},
	{
		"quote": "In theory, theory and practice are the same. In practice, they're not.",
		"source": "Yoggi Berra"
	},
	{
		"quote": "You can't have great software without a great team, and most software teams behave like dysfunctional families.",
		"source": "Jim McCarthy"
	},
	{
		"quote": "The best programmers are not marginally better than merely good ones. They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability.",
		"source": "Randall E. Stross"
	},
	{
		"quote": "People think that computer science is the art of geniuses but the actual reality is the opposite, just many people doing things that build on each other, like a wall of mini stones.",
		"source": "Donald Knuth"
	},
	{
		"quote": "Most good programmers do programming not because they expect to get paid or get adulation by the public, but because it is fun to program.",
		"source": "Linus Torvalds"
	},
	{
		"quote": "Sufficiently advanced incompetence is indistinguishable from malice.",
		"source": "Modified Clark's Law by J. Porter Clark"
	},
	{
		"quote": "A computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things. They are, in short, a perfect match.",
		"source": "Bill Bryson"
	},
	{
		"quote": "The question of whether computers can think is just like the question of whether submarines can swim.",
		"source": "Edsger W. Dijkstra"
	},
	{
		"quote": "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
		"source": "Martin Golding"
	},
	{
		"quote": "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
		"source": "Martin Fowler"
	},
	{
		"quote": "A computer lets you make more mistakes faster than any other invention in human history, with the possible exceptions of handguns and tequila.",
		"source": "Mitch Ratcliffe"
	},
	{
		"quote": "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
		"source": "Brian W. Kernighan"
	},
	{
		"quote": "Some people, when confronted with a problem, think \"I know, I'll use regular expressions.\" Now they have two problems.",
		"source": "Jamie Zawinski"
	},
	{
		"quote": "The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.",
		"source": "Tom Cargill"
	},
	{
		"quote": "There are only two kinds of languages: the ones people complain about and the ones nobody uses.",
		"source": "Bjarne Stroustrup"
	},
	{
		"quote": "It's all talk until the code runs.",
		"source": "Ward Cunningham"
	},
	{
		"quote": "Given enough eyeballs, all bugs are shallow.",
		"source": "Linus Torvalds (open source)"
	},
	{
		"quote": "A clever person solves a problem. A wise person avoids it.",
		"source": "Albert Einstein"
	},
	{
		"quote": "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code.",
		"source": "Dan Salomon"
	},
	{
		"quote": "To replace programmers with robots, clients will have to accurately describe what they want. We're safe.",
		"source": "@TheProgrammerMe"
	},
	{
		"quote": "The art of debugging is figuring out what you really told your program to do rather than what you thought you told it to do.",
		"source": "Andrew Singer"
	},
	{
		"quote": "Being a good software engineer is 3% talent, 97% not being distracted by the internet.",
		"source": "Unknown (motivation)"
	},
	{
		"quote": "Never trust a computer you can't throw out a window.",
		"source": "Steve Wozniak"
	},
	{ "quote": "A good programmer is someone who always looks both ways before crossing a one-way street.",
		"source": "Doug Linder"
	},
	{
		"quote": "There are two ways to write error-free programs; only the third one works.",
		"source": "Alan J. Perlis"
	},
	{
		"quote": "Code is like humor. When you have to explain it, it's bad.",
		"source": "Cory House"
	},
	{
		"quote": "Debugging is like being a detective in a crime movie where you're also the murderer.",
		"source": "Filipe Fortes"
	},
	{
		"quote": "When in doubt, use brute force.",
		"source": "Ken Thompson"
	},
	{
		"quote": "Once a new technology starts rolling, if you're not part of the steamroller, you're part of the road.",
		"source": "Stewart Brand"
	},
	{
		"quote": "The most disastrous thing that you can ever learn is your first programming language.",
		"source": "Alan Kay"
	},
	{
		"quote": "Optimism is an occupational hazard of programming. Feedback is the treatment.",
		"source": "Kent Beck"
	},
	{
		"quote": "The function of good software is to make the complex appear to be simple.",
		"source": "Grady Booch"
	},
	{
		"quote": "I'm not a great programmer. I'm just a good programmer with great habits.",
		"source": "Kent Beck"
	},
	{
		"quote": "One man's crappy software is another man's full-time job.",
		"source": "Jessica Gaston"
	},
	{
		"quote": "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the universe trying to produce bigger and better idiots. So far, the universe is winning.",
		"source": "Rick Cook"
	},
	{
		"quote": "One trick to programming faster is to do less in your head & run the code more.",
		"source": "Greg Brockman"
	},
	{
		"quote": "Programs must be written for people to read, and only incidentally for machines to execute.",
		"source": "Hal Abelson"
	},
	{
		"quote": "Controlling complexity is the essence of computer programming.",
		"source": "Brian W. Kernighan"
	},
	{ "quote": "Code never lies, comments sometimes do.",
		"source": "Ron Jeffries"
	},
	{
		"quote": "The best way to predict the future is to invent it.",
		"source": "John Kenneth Galbraith"
	},
	{
		"quote": "Copy and paste is a design error.",
		"source": "David Parnas"
	},
	{
		"quote": "Crash programs fail because they are based on theory that, with nine women pregnant, you can get a baby in a month.",
		"source": "Wernher Von Braun"
	},
	{
		"quote": "Einstein repeatedly argued that there must be simplified explanations of nature, because God is not capricious or arbitrary. No such faith comforts the software engineer.",
		"source": "Fred Brooks"
	}
]
